nv-11/benchmark_results/pd-ex-databse/pd-16-gds-noarcc/20251202-071900-bench.log
[2025-12-02 07:19:00] Log file: /benchmark_results/pd-16-gds-noarcc/20251202-071900-bench.log
[2025-12-02 07:19:00] ==========================================
[2025-12-02 07:19:00] PD Benchmark Configuration
[2025-12-02 07:19:00] ==========================================
[2025-12-02 07:19:00] Model: /models/Qwen3-30B-A3B-Instruct-2507-FP8
[2025-12-02 07:19:00] Served Model Name: Qwen3-30B-A3B-Instruct-2507-FP8
[2025-12-02 07:19:00] Base URL: http://localhost:30805
[2025-12-02 07:19:00] Output Directory: /benchmark_results/pd-16-gds-noarcc
[2025-12-02 07:19:00] Case Name: pd-16-gds-noarcc
[2025-12-02 07:19:00] ------------------------------------------
[2025-12-02 07:19:00] Test Type: combined
[2025-12-02 07:19:00] Test Parameters:
[2025-12-02 07:19:00]   Number of Prompts: 160
[2025-12-02 07:19:00]   Request Rate: 128
[2025-12-02 07:19:00]   Decode Output Length: 10
[2025-12-02 07:19:00]   Input Lengths: 100 1000 10000 20000 50000
[2025-12-02 07:19:00]   Base Seed: 45
[2025-12-02 07:19:00] ------------------------------------------
[2025-12-02 07:19:00] Warmup: true
[2025-12-02 07:19:00]   Warmup Prompts: 5
[2025-12-02 07:19:00]   Warmup Input Length: 100
[2025-12-02 07:19:00]   Warmup Seed: 2
[2025-12-02 07:19:00] ==========================================
[2025-12-02 07:19:00] ==========================================
[2025-12-02 07:19:00] Running warmup...
[2025-12-02 07:19:00] ==========================================
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-02 07:19:04 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff4e5638220>, seed=2, num_prompts=5, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=1, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=1, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=['type=warmup'], result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-02 07:19:09 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [1, 1]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 36:28:31 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 5/5 [00:00<00:00, 10.06it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     5         
Maximum request concurrency:             1         
Benchmark duration (s):                  0.50      
Total input tokens:                      500       
Total generated tokens:                  5         
Request throughput (req/s):              10.06     
Output token throughput (tok/s):         10.06     
Peak output token throughput (tok/s):    5.00      
Peak concurrent requests:                5.00      
Total Token throughput (tok/s):          1015.70   
---------------Time to First Token----------------
Mean TTFT (ms):                          98.85     
Median TTFT (ms):                        99.25     
P99 TTFT (ms):                           110.96    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          0.00      
Median TPOT (ms):                        0.00      
P99 TPOT (ms):                           0.00      
---------------Inter-token Latency----------------
Mean ITL (ms):                           0.00      
Median ITL (ms):                         0.00      
P99 ITL (ms):                            0.00      
==================================================
[2025-12-02 07:19:10] Warmup completed
[2025-12-02 07:19:11] ==========================================
[2025-12-02 07:19:11] Starting PD Combined Tests
[2025-12-02 07:19:11] ==========================================
[2025-12-02 07:19:11] IMPORTANT: Ensure the model is deployed in PD mode!
[2025-12-02 07:19:11] ==========================================
[2025-12-02 07:19:11] ------------------------------------------
[2025-12-02 07:19:11] Testing with input_len=100, seed=145
[2025-12-02 07:19:11] ------------------------------------------
[2025-12-02 07:19:11] ==========================================
[2025-12-02 07:19:11] Running PD Combined Test
[2025-12-02 07:19:11] Input Length: 100, Seed: 145
[2025-12-02 07:19:11] ==========================================
[2025-12-02 07:19:11] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-02 07:19:14 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f5721038220>, seed=145, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=100, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=100,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-16-gds-noarcc/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-02 07:19:19 [datasets.py:507] Sampling input_len from [100, 100] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 64:43:46 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:05<00:00, 30.98it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  5.16      
Total input tokens:                      15907     
Total generated tokens:                  1600      
Request throughput (req/s):              30.98     
Output token throughput (tok/s):         309.81    
Peak output token throughput (tok/s):    757.00    
Peak concurrent requests:                136.00    
Total Token throughput (tok/s):          3389.92   
---------------Time to First Token----------------
Mean TTFT (ms):                          838.25    
Median TTFT (ms):                        157.56    
P99 TTFT (ms):                           3948.31   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          40.70     
Median TPOT (ms):                        13.08     
P99 TPOT (ms):                           344.50    
---------------Inter-token Latency----------------
Mean ITL (ms):                           40.70     
Median ITL (ms):                         11.77     
P99 ITL (ms):                            1963.82   
==================================================
[2025-12-02 07:19:25] PD Combined test completed for input_len=100
[2025-12-02 07:19:27] Completed combined test for input_len=100
[2025-12-02 07:19:27] 
[2025-12-02 07:19:27] ------------------------------------------
[2025-12-02 07:19:27] Testing with input_len=1000, seed=1045
[2025-12-02 07:19:27] ------------------------------------------
[2025-12-02 07:19:27] ==========================================
[2025-12-02 07:19:27] Running PD Combined Test
[2025-12-02 07:19:27] Input Length: 1000, Seed: 1045
[2025-12-02 07:19:27] ==========================================
[2025-12-02 07:19:27] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-02 07:19:31 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f7fbafcc220>, seed=1045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=1000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-16-gds-noarcc/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-02 07:19:35 [datasets.py:507] Sampling input_len from [1000, 1000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 112:45:03 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:02<00:00, 53.71it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  2.98      
Total input tokens:                      159690    
Total generated tokens:                  1600      
Request throughput (req/s):              53.70     
Output token throughput (tok/s):         537.03    
Peak output token throughput (tok/s):    600.00    
Peak concurrent requests:                124.00    
Total Token throughput (tok/s):          54136.36  
---------------Time to First Token----------------
Mean TTFT (ms):                          792.94    
Median TTFT (ms):                        354.65    
P99 TTFT (ms):                           2429.62   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.28     
Median TPOT (ms):                        16.03     
P99 TPOT (ms):                           279.62    
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.28     
Median ITL (ms):                         12.07     
P99 ITL (ms):                            195.68    
==================================================
[2025-12-02 07:19:41] PD Combined test completed for input_len=1000
[2025-12-02 07:19:43] Completed combined test for input_len=1000
[2025-12-02 07:19:43] 
[2025-12-02 07:19:43] ------------------------------------------
[2025-12-02 07:19:43] Testing with input_len=10000, seed=10045
[2025-12-02 07:19:43] ------------------------------------------
[2025-12-02 07:19:43] ==========================================
[2025-12-02 07:19:43] Running PD Combined Test
[2025-12-02 07:19:43] Input Length: 10000, Seed: 10045
[2025-12-02 07:19:43] ==========================================
[2025-12-02 07:19:43] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-02 07:19:46 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f85d58dc220>, seed=10045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=10000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=10000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-16-gds-noarcc/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-02 07:19:51 [datasets.py:507] Sampling input_len from [10000, 10000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:00 elapsed, 142:23:40 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [02:09<00:00,  1.24it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  129.46    
Total input tokens:                      1599978   
Total generated tokens:                  1591      
Request throughput (req/s):              1.24      
Output token throughput (tok/s):         12.29     
Peak output token throughput (tok/s):    246.00    
Peak concurrent requests:                159.00    
Total Token throughput (tok/s):          12371.00  
---------------Time to First Token----------------
Mean TTFT (ms):                          65745.65  
Median TTFT (ms):                        83591.46  
P99 TTFT (ms):                           128017.75 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1097.15   
Median TPOT (ms):                        436.93    
P99 TPOT (ms):                           12011.46  
---------------Inter-token Latency----------------
Mean ITL (ms):                           1097.15   
Median ITL (ms):                         414.82    
P99 ITL (ms):                            34249.64  
==================================================
[2025-12-02 07:22:10] PD Combined test completed for input_len=10000
[2025-12-02 07:22:12] Completed combined test for input_len=10000
[2025-12-02 07:22:12] 
[2025-12-02 07:22:12] ------------------------------------------
[2025-12-02 07:22:12] Testing with input_len=20000, seed=20045
[2025-12-02 07:22:12] ------------------------------------------
[2025-12-02 07:22:12] ==========================================
[2025-12-02 07:22:12] Running PD Combined Test
[2025-12-02 07:22:12] Input Length: 20000, Seed: 20045
[2025-12-02 07:22:12] ==========================================
[2025-12-02 07:22:12] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-02 07:22:15 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f9f360e4360>, seed=20045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=20000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=20000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-16-gds-noarcc/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-02 07:22:20 [datasets.py:507] Sampling input_len from [20000, 20000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:02 elapsed, 283:46:16 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [00:38<00:00,  4.11it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  38.90     
Total input tokens:                      3200000   
Total generated tokens:                  1591      
Request throughput (req/s):              4.11      
Output token throughput (tok/s):         40.90     
Peak output token throughput (tok/s):    98.00     
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          82298.57  
---------------Time to First Token----------------
Mean TTFT (ms):                          17636.25  
Median TTFT (ms):                        18009.49  
P99 TTFT (ms):                           35787.27  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          958.47    
Median TPOT (ms):                        1008.32   
P99 TPOT (ms):                           2040.76   
---------------Inter-token Latency----------------
Mean ITL (ms):                           958.47    
Median ITL (ms):                         650.52    
P99 ITL (ms):                            4911.97   
==================================================
[2025-12-02 07:23:17] PD Combined test completed for input_len=20000
[2025-12-02 07:23:19] Completed combined test for input_len=20000
[2025-12-02 07:23:19] 
[2025-12-02 07:23:19] ------------------------------------------
[2025-12-02 07:23:19] Testing with input_len=50000, seed=50045
[2025-12-02 07:23:19] ------------------------------------------
[2025-12-02 07:23:19] ==========================================
[2025-12-02 07:23:19] Running PD Combined Test
[2025-12-02 07:23:19] Input Length: 50000, Seed: 50045
[2025-12-02 07:23:19] ==========================================
[2025-12-02 07:23:19] NOTE: Make sure the model is deployed in PD mode!
/opt/venv/lib/python3.12/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 12-02 07:23:22 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ff95f5b4220>, seed=50045, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=50000, random_output_len=10, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url='http://localhost:30805', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/models/Qwen3-30B-A3B-Instruct-2507-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=128.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=True, metadata=['type=pd,input_len=50000,output_len=10'], result_dir=None, result_filename='/benchmark_results/pd-16-gds-noarcc/benchmark_result.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='Qwen3-30B-A3B-Instruct-2507-FP8', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-02 07:23:27 [datasets.py:507] Sampling input_len from [50000, 50000] and output_len from [10, 10]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 02:31 elapsed, 34942:45:09 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: 128.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 160/160 [07:09<00:00,  2.68s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Request rate configured (RPS):           128.00    
Benchmark duration (s):                  429.54    
Total input tokens:                      8000000   
Total generated tokens:                  1537      
Request throughput (req/s):              0.37      
Output token throughput (tok/s):         3.58      
Peak output token throughput (tok/s):    40.00     
Peak concurrent requests:                160.00    
Total Token throughput (tok/s):          18628.19  
---------------Time to First Token----------------
Mean TTFT (ms):                          99462.73  
Median TTFT (ms):                        82024.20  
P99 TTFT (ms):                           381065.97 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          1879.85   
Median TPOT (ms):                        1331.10   
P99 TPOT (ms):                           14219.68  
---------------Inter-token Latency----------------
Mean ITL (ms):                           1914.05   
Median ITL (ms):                         1126.80   
P99 ITL (ms):                            32987.70  
==================================================
[2025-12-02 07:33:39] PD Combined test completed for input_len=50000
[2025-12-02 07:33:41] Completed combined test for input_len=50000
[2025-12-02 07:33:41] 
[2025-12-02 07:33:41] ==========================================
[2025-12-02 07:33:41] All PD Combined Tests Completed
[2025-12-02 07:33:41] ==========================================
[2025-12-02 07:33:41] ==========================================
[2025-12-02 07:33:41] Test Results Summary
[2025-12-02 07:33:41] ==========================================
[2025-12-02 07:33:41] Results saved to: /benchmark_results/pd-16-gds-noarcc/benchmark_result.json
[2025-12-02 07:33:41] Result file size: 208K
[2025-12-02 07:33:41] Total test cases: 0
0
[2025-12-02 07:33:41] ==========================================
[2025-12-02 07:33:41] Total execution time: 881 seconds
[2025-12-02 07:33:41] Test completed successfully!